^[A-Z]+-[\d]+[\s] ==> pour les sigles

^[A-Z]+-[\d]{4}\n ==> pour les sigles ===

\b([A-Z]([a-z]|[à-ù])+[\W]+[\w]+)[\s]
\b([A-Z]([a-zà-ù])+[\W]+[\w]+)[\s]
^([A-Z]([a-zà-ù])+[\W]+[\w\s]+)[\s]

((\b[A-Z]{1,2})|(\b[A-Z][\d]))[\s]\n ==> Sections
((^[A-Z]{1,2})|(^[A-Z][\d]))[\s]==> Sections ===



^[A-Z]{1,2}(?:[\d\s])==> Sections =====

^[\d]{1}$ ==> Crédits


------------------------------------------------------------------------------------------

^[A-Z]{1,2}([\d]*)[\s] ==> Sections

^[A-Z]+-[\d]{4} ==> pour les sigles


^[\d]+$ ==> Crédits


^[A-Z]([a-zà-ù])([^\s&^\(]+[\s])* ==> Post traitemeent Python

^[A-Z]([a-zà-ù])([^\s&(^\(|N)]+[\s])* ===> v2